# 1) მომხმარებელს შემოაყვანინეთ თავისი ასაკი, 
# შემდგომ შეამოწმეთ, იმ შემთხვევაში თუ მომხარებლის ასაკი დადებითია, 
# ტერმინალში გამოიტანეთ "თქვენი ასაკი დადებითია", 
# ყველა სხვა შემთხვევაში "თქვენი ასაკი უარყოფითია".

# 2) შექმენით კვირის დღეების მასივი, 
# შემდგომ მომხმარებელს შემოაყვანინეთ ინდექსი 
# და დაბეჭდეთ შესაბამისი კვირის დღე სიიდან.

# 1

age = int(input("შემოიყვანეთ თქვენი ასაკი"))
if age > 0:
    print("თქვენი ასაკი უარყოფილია")
else:
    print("თქვენი ასაკი მიღებულია / არ არის სოწორი")

# 2

week_days = ["ორშაბათი", "სამშაბათი", "ოთხშაბათ", "ხუთშაბათი", "პარასკევი", "შაბათი", "კვირა"]
index = int(input("შემოიყვანეთ კვირის დღის ინდექსი (0-დან 6-მდე): "))
if 0 <= index < len(week_days):
    print(f"შესაბამისი დღეა: {week_days[index]}")
else:
    print(f"არასორი დღეა: {week_days[index]}")

# 3) შექმენით შერეული სია 
# (უნდა იყოს ამ სიაში სტრინგებიც, რიცხვებიც, ბულიანებიც და ა.შ) 
# მინიმუმ 15 ელემენტით, შემდგომ for ციკლის დახმარებით 
# დაითვალეთ რამდენი ელემენტის ამ სიაში.

mixed_list = ["apple", "True", 21, 3.17, "python", "batumi", True, False, "code", 117, 92.1, True]
count = 0
for element in mixed_list:
    count += 1

print(f"სიაში ელემენტების რაოდენობაა: {count} ")

# 4) შექმენით 10 რიცხვისგან შემდგარი მასივი, 
# შემდგომ for ციკლის დახმარებით ტერმინალში გამოიტანეთ 
# მხოლოდ ლუწ ინდექსზე მდგომი რიცხვები.

numbers = [12, 13, 45, 77, 777, 81, 39, 40]
for i in range(0, len(numbers), 2):
    print(f"ინდექსი {i}: {numbers[i]}")










